
自15年决定走技术，到16年离职进行前端学习，5月份参加工作以来，现18年5月份，满打满算已经有2年的前端工作经验。
两年的时间很长，感觉过的很快，回头看看，从盐光到现在的微易，从写vue到react再到vue，一直奋斗在前端第一线上，
最大的变化，从“一个不懂得如何写业务的新手”到“只是懂得写业务的新手”。it是一个发展超快速的行业，身在其中，不进
则退，保持好奇心，保持持续学习是一名合格程序员的基本品质。定位自身现状，感觉自己学习很多东西，实则只是皮毛，
究其远离，一脸懵逼；定位职业发展，感觉计划长远，实则虚而不实，只有方向没有落地方法，积极性也没有很高，表面上
是被日常工作业务困扰，实则表明技术功底不扎实。
今天看了“为什么我不推荐使用vue-cli创建脚手架”这篇文章，很有感触，一方面来自技术层面：看到这个标题，我应该
大致清楚文章内容讲的主要内容，加之前端时间近春跟我说他都是手写脚手架给我带来的“打击”，让我对前端工程化技术
有更深入了解的欲望；另一方方面来自文章中提高，对于初级前端工程师和中级前端工程师的区别所有的理解，
在于对难以解决bug的解决能力，身为一直前端一线奋斗的我有些不甘心，其实我有突破前端发展的野心，自己做前端两年，
为什么我就只能在前端一线搬砖？因为我只是解决我在业务开发中的bug，我从来都不会去解决更高层次带来的bug，比如
如何定制一套脚手架等等。
我一直在发现问题，但是从来都没有去认真的解决问题。比如阅读jquery源码，课程只看到一般；比如平时在各种平台上
收藏的文章，只看标题没有深入地去研究内容；再比如即使研究了react简单实现，但是我真正懂了吗，不懂我问了吗？
学技术似懂非懂，这是程序员的大忌，注定成为不了一名优秀的开发者。